In [2]:
import pandas as pd
import xgboost as xgb

In [3]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
test_ids = pd.DataFrame(test['id'])
test_ids = test_ids.reset_index(drop = True)

In [4]:
train.head()

,id,timestamp,full_sq,life_sq,floor,max_floor,material,build_year,num_room,kitch_sq,...,cafe_count_5000_price_2500,cafe_count_5000_price_4000,cafe_count_5000_price_high,big_church_count_5000,church_count_5000,mosque_count_5000,leisure_count_5000,sport_count_5000,market_count_5000,price_doc
0,1,8/20/11,43,27,4,NaN,NaN,NaN,NaN,NaN,...,9,4,0,13,22,1,0,52,4,5850000
1,2,8/23/11,34,19,3,NaN,NaN,NaN,NaN,NaN,...,15,3,0,15,29,1,10,66,14,6000000
2,3,8/27/11,43,29,2,NaN,NaN,NaN,NaN,NaN,...,10,3,0,11,27,0,4,67,10,5700000
3,4,9/1/11,89,50,9,NaN,NaN,NaN,NaN,NaN,...,11,2,1,4,4,0,0,26,3,13100000
4,5,9/5/11,77,77,4,NaN,NaN,NaN,NaN,NaN,...,319,108,17,135,236,2,91,195,14,16331452

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30471 entries, 0 to 30470
Columns: 292 entries, id to price_doc
dtypes: float64(119), int64(157), object(16)
memory usage: 68.1+ MB

In [6]:
train['price_doc'].median()

6274411.0

In [7]:
#null accuracy submission

test_ids['price_doc'] = 6274411

result = test_ids
result.head()

      id  price_doc
0  30474    6274411
1  30475    6274411
2  30476    6274411
3  30477    6274411
4  30478    6274411

In [39]:
result.to_csv('submission.csv', sep = ',', index = False)